tutorials/rigidBodyAndBeam_monolithic/0/beam/Gamma
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       surfaceVectorField;
    location    "2";
    object      Gamma;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

oriented        oriented;

internalField   nonuniform List<vector> 
59
(
(0.129305 -3.29019e-22 1.39309e-08)
(0.129305 2.50561e-22 -8.3364e-09)
(0.129305 -9.74344e-23 4.9886e-09)
(0.129305 1.19202e-22 -2.98523e-09)
(0.129305 3.77864e-24 1.7864e-09)
(0.129305 7.14774e-23 -1.069e-09)
(0.129305 3.51818e-23 6.39702e-10)
(0.129305 7.33244e-23 -3.82805e-10)
...
)
;

boundaryField
{
    left
    {
        type            calculated;
        value           uniform (-0.129305 -4.51722e-14 2.32798e-08);
    }
    right
    {
        type            calculated;
        value           uniform (0.129305 -4.51671e-14 2.32783e-08);
    }
    beam
    {
        type            empty;
        value           nonuniform List<vector> 0();
    }
}


// ************************************************************************* //
