tutorials/rigidBodyAndBeam_monolithic/0/beam/explicitM
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       surfaceVectorField;
    location    "2";
    object      explicitM;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 2 -2 0 0 0 0];

oriented        oriented;

internalField   nonuniform List<vector> 
59
(
(3.78331e-23 -3.1209e-08 -9.17672e-22)
(3.64871e-23 -1.25332e-08 -1.68964e-22)
(3.51086e-23 -2.3709e-08 -3.79921e-22)
(3.37621e-23 -1.70213e-08 -2.69778e-23)
(3.24081e-23 -2.10233e-08 -6.8326e-23)
(3.10694e-23 -1.86284e-08 7.9989e-23)
(2.97328e-23 -2.00615e-08 7.95747e-23)
(2.84044e-23 -1.92039e-08 9.80231e-23)
...
)
;

boundaryField
{
    left
    {
        type            calculated;
        value           uniform (9.59625e-37 -3.52162e-28 2.49045e-40);
    }
    right
    {
        type            calculated;
        value           uniform (4.05065e-36 -8.80306e-28 1.82591e-40);
    }
    beam
    {
        type            empty;
        value           nonuniform List<vector> 0();
    }
}


// ************************************************************************* //
