tutorials/rigidBodyAndBeam_monolithic/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    left
    {
        type  totalPressure;
        p0    uniform 0;
    }
    right
    {
        type  totalPressure;
        p0    uniform 0;
    }
    front
    {
        type  totalPressure;
        p0    uniform 0;
    }
    back
    {
        type  totalPressure;
        p0    uniform 0;
    }
    top
    {
        type  totalPressure;
        p0    uniform 0;
    }
    bottom
    {
        type  fixedFluxExtrapolatedPressure;
        value uniform 0;
    }
    floatingObject
    {
        type  fixedFluxExtrapolatedPressure;
        value uniform 0;
    }
}

// ************************************************************************* //
