tutorials/rigidBodyAndBeam_monolithic/constant/beam/timeVsMoment
(
    ( 0 (0 0 0) )
    ( 3 (0 0 0) )
)
